Revit.Elements.Tag.HeadLocation
The position of the head of tag in model coordinates.

Revit.Elements.Tag.SetHeadLocation(Autodesk.DesignScript.Geometry.Point)
Set the position of the head of tag.
location:
Returns:

Revit.Elements.Tag.LeaderElbow
The position of the elbow of the tag's leader.

Revit.Elements.Tag.SetLeaderElbow(Autodesk.DesignScript.Geometry.Point)
Set the position of the elbow of the tag's leader.
location:
Returns:

Revit.Elements.Tag.LeaderEnd
The position of the leader end for a tag using free end leader behavior.

Revit.Elements.Tag.SetLeaderEnd(Autodesk.DesignScript.Geometry.Point)
Set the position of the leader end for a tag using free end leader behavior.
location:
Returns:

Revit.Elements.Tag.GetLeaderEndCondition
Get Tag's leaderEnd condition.

Revit.Elements.Tag.SetLeaderEndCondition(System.String)
Set Tag's LeaderEnd condition.
leaderEndCondition:
Returns: